---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.CutMarkType
source: html/d6c52952-5ead-2fc0-e29b-885a5863d0c6.htm
---
# CutMarkType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.